# **Задача 1**

Представьте, что вы работаете в небольшой компании. 
Данные сотрудников хранятся в неструктурированном формате. 
Бухгалтерия попросила написать программу, в которой  можно работать с Ф. И. О. сотрудников.

Напишите четыре строки:

С именем firstName — для хранения имени.
С именем middleName — для хранения отчества.
С именем lastName — для хранения фамилии.
С именем fullName — для хранения Ф. И. О. сотрудника в формате "Фамилия Имя Отчество".
Выведите в консоль фразу: «ФИО сотрудника — …».

В качестве данных для задачи используйте "Ivanov Ivan Ivanovich".

Критерии оценки

Инициализировали строки верно.
Сложение строк провели корректно.
При изменении данных в строках результат программы выводится корректно.
Все условия задания выполнили.

# **Задача 2**

Для ежемесячного отчета и ведения документации бухгалтерии нужны Ф. И. О. сотрудников, полностью написанные заглавными буквами (верхним регистром).

Напишите программу, которая изменит написание Ф. И. О. сотрудника с "Ivanov Ivan Ivanovich" на полностью заглавные буквы.

В качестве строки с исходными данными используйте строку fullName.

Результат программы выведите в консоль в формате: "Данные ФИО сотрудника для заполнения отчета — …"

Подсказка

# Для решения задачи используйте метод **toUpperCase().** Этот метод преобразует все знаки в строке в верхний регистр.

Пример работы метода:

String small = "abcd";
System.out.println(small.toUpperCase());

Результат в консоли:

ABCD

Подробнее о работе метода toUpperCase() читайте в шпаргалке.

Критерии оценки
Применили метод, меняющий регистр символов строки.
При изменении содержания строки результат программы выполняется.
Результат программы вывели в консоль согласно условиям задачи.


# **Задача 3**

Система, в которой мы работаем, не принимает символ «ё». Напишите программу, которая заменяет символ «ё» на символ «е».

В качестве исходных данных используйте строку fullName и данные в ней — "Иванов Семён Семёнович".

Выведите результат программы в консоль в формате: «Данные ФИО сотрудника — ...».

Критерии оценки

Применили метод, меняющий написание данных строки.
При изменении содержания строки результат программы выполняется.
Результат программы вывели в консоль согласно условиям задачи.